{
  "blogs": [
    {
      "id": "ddb5",
      "title": "A day in the life of an average CSE student ",
      "body": "The alarm's shrill cry jolts me awake at 9 AM, a mere 30 minutes before my first class. The temptation to hit snooze is strong, but the fear of being late for class is stronger. Mornings are a whirlwind of rushed skincare routines and questionable fashion choices. Breakfast? Luxury I can't afford.\n\nLectures are an interesting concept. I attend them, sort of. My attention span is inversely proportional to the lecturer's enthusiasm. My phone becomes an unwitting accomplice, a silent escape from the monotony of theoretical concepts. The allure of social media is often stronger than the allure of algorithms.\n\nClass timings are a mystery, an ever-changing puzzle. One day it's a marathon session, the next, a sprint. This unpredictable schedule wreaks havoc on my sleep patterns and meal timings. But hey, at least I have ample opportunities to explore the campus and its hidden food havens.\n\nWhen the academic rigmarole finally concludes, the gym beckons. Two hours of pumping iron is my therapy, a way to channel my frustrations and build physical strength. Post-workout, the world seems a little brighter.\n\nEvenings are a mix of social life and solitary coding. Hostels are a melting pot of cultures and friendships, providing endless opportunities for fun and distraction. Yet, the allure of the code is irresistible. I often find myself losing track of time, engrossed in a project, only to realize it's the wee hours of the morning.\n\nSkincare is my non-negotiable ritual. It's my 'me' time, a brief escape from the digital world. And then, it's back to the screen, this time for entertainment rather than education. Movies, series, or social media – a perfect way to unwind before drifting off to sleep, ready to start another chaotic day.\n\nBeing a CSE student is a rollercoaster. It's a blend of academic pressures, social life, and personal growth. It's about managing time, juggling priorities, and finding balance. And while it's undeniably challenging, it's also an adventure I wouldn't trade for anything.",
      "author": "diya"
    },
    {
      "id": "3f68",
      "title": "From the Court to the Code: My Diverse Interests",
      "body": "Being a student is more than just textbooks and exams; it's about finding a balance between academics and personal interests. My world revolves around a unique blend of physical exertion, mental stimulation, and pure relaxation.\n\nBasketball is my first love. The rhythmic thump of the ball against the court, the camaraderie of the team, and the adrenaline rush of scoring a basket are an unbeatable combination. It's more than just a sport; it's a stress buster and a confidence booster rolled into one. The gym is my second home, a sacred space where I sculpt my body and mind. The rhythmic repetition of lifts and the gradual transformation are incredibly satisfying.\n\nWhen I'm not on the court or lifting weights, I find solace and challenge in coding. The world of logic and problem-solving is a fascinating one. There's an undeniable thrill in seeing lines of code come to life and create something tangible. Hours can slip by unnoticed as I immerse myself in a coding project, a state of flow that's both exhilarating and exhausting.\n\nTo balance the intensity of academics and physical exertion, I indulge in the guilty pleasure of binge-watching. There's something undeniably comforting about losing myself in a captivating storyline. It's a digital escape, a chance to relax and recharge.\n\nThis eclectic mix of hobbies keeps my life interesting and fulfilling. Basketball for the physicality, coding for the mental stimulation, and binge-watching for pure relaxation. It's a delicate balance, but one that I've come to cherish.",
      "author": "diya"
    },
    {
      "id": "86af",
      "title": "Kochi Chronicles",
      "body": "Coming to college was a whirlwind of new experiences, and Kochi, with its unique blend of old-world charm and modern vibrancy, was an unexpected gem. I arrived with a suitcase full of expectations, but Kochi had something entirely different in store.\n\nMy initial days were spent navigating the bustling streets, a maze of colorful houses and ancient churches. Fort Kochi, with its colonial architecture and serene backwaters, cast a spell on me. I found myself drawn to the Jewish Synagogue, a testament to the city's rich history. The Chinese fishing nets against the backdrop of the Arabian Sea were a sight to behold, a timeless tradition in a rapidly changing world.\n\nMattancherry Palace, with its intricate carvings and murals, transported me to a bygone era. Exploring the spice markets was an olfactory adventure, a symphony of aromas that tantalized my senses. Every corner of Kochi seemed to hold a story, waiting to be discovered.\n\nBeyond the historical landmarks, Kochi's contemporary side captivated me. The city's thriving art scene, with its eclectic mix of galleries and street art, was a refreshing change of pace. The cafes and restaurants offered a culinary journey, from traditional Kerala cuisine to international flavors.\n\nAs days turned into weeks, Kochi became more than just a city; it became a part of me. The warmth of the people, the beauty of the landscape, and the endless possibilities for exploration made it a place I called home away from home.",
      "author": "diya"
    }
  ]
}